/*
Note for the Localization Engineer:
The strings enclosed within < > should NOT be localized. Eg : <OPERATION>
*/

/* Recovery options for the errors */
TryAgainButtonTitle = "Riprova";
CancelButtonTitle = "Annulla";


/*Error descriptions for corrupted store*/
CorruptedEventStoreDescription = "<OPERATION> perché è impossibile leggere il file: “/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”.";

/*Error descriptions for missing store*/
MissingEventStoreDescription = "<OPERATION> perché è impossibile trovare il file \"/Users/Shared/HP/HP Event Store/HPEventStore.hpstore\".";

/*Recovery suggestion for corrupted and missing store.*/
MissingEventStoreRecoverySuggesstion = "Sostituire il file “HPEventStore.hpstore”, se è stato spostato o rimosso, quindi fare clic su “Riprova”.\rPer creare un nuovo file, fare clic su “Crea”.";

/* Recovery options for corrupted and missing store */
CreateButtonTitle = "Crea";

/*Error descriptions for permission error*/
EventStorePermissionsErrorDescription = "<OPERATION> perché l'applicazione non può accedere al file \"/Users/Shared/HP/HP Event Store/HPEventStore.hpstore\".";

/* Recovery options for corrupted and missing store */
RepairAccessButtonTitle = "Ripara accesso";

/*Added new key to refer error recovery suggestion if the permission is not proper.*/
EventStorePermissionsErrorRecoverySuggesstion = "Controllare le cartelle di “HPEventStore.hpstore” per verificare che non siano bloccate e che l'autorizzazione sia in “Lettura e scrittura”, quindi fare clic su “Riprova”.\rPer fare in modo che l'applicazione tenti di riparare le autorizzazione, fare clic su “Ripara accesso”.";

//Error description for out of disk space error
DiskFullErrorDescription = "<OPERATION> per insufficienza di spazio sul disco di avvio.";

//Recover suggestion for out of disk space error
DiskFullErrorRecoverySuggesstion = "Rimuovere alcuni file dal disco, quindi fare clic su “Riprova”.";